PinkFluffyUnic0rn/stm32flash/w25.c
#include "stm32f1xx_hal.h"
#include <stdint.h>
#include <string.h>

#include "w25.h"

#define w25fs_checksum_t uint32_t

#define W25FS_INODESECTORSCOUNT 15
#define W25FS_INODESSZ (W25_SECTORSIZE * W25FS_INODESECTORSCOUNT)
#define W25FS_INODEPERSECTOR (W25_SECTORSIZE / sizeof(struct w25fs_inode))
#define W25FS_RETRYCOUNT 5
#define W25FS_DIRSIZE (W25_SECTORSIZE - sizeof(struct w25fs_blockmeta))
#define W25FS_DIRRECORDSIZE 32
#define W25FS_ROOTINODE 0x0001000

#define _W25FS_NODATABLOCKS	0xffffff01
#define _W25FS_WRONGADDR	0xffffff02
#define _W25FS_BADDATABLOCK	0xffffff03
#define _W25FS_WRONGSIZE	0xffffff04
#define _W25FS_PATHTOOLONG	0xffffff05
#define _W25FS_INODENOTFOUND	0xffffff06
#define _W25FS_NAMENOTFOUND	0xffffff07
#define _W25FS_NOTADIR		0xffffff08
#define _W25FS_NOTAFILE		0xffffff09
#define _W25FS_NOTAFILE		0xffffff09
#define _W25FS_EDIRNOTEMPTY	0xffffff0a
#define _W25FS_EALREADYEXISTS	0xffffff0b

#define w25fs_blockgetmeta(b) (((struct w25fs_blockmeta *) (b)))
#define w25fs_uint2interr(v) (-((v) & 0xff))
#define w25fs_iserror(v) ((v) > 0xffffff00)

#define min(a, b) ((a) < (b) ? (a) : (b))

struct w25fs_superblock {
	w25fs_checksum_t checksum;
	uint32_t inodecnt;
	uint32_t inodesz;
	uint32_t inodestart;
	uint32_t freeinodes;
	uint32_t blockstart;
	uint32_t freeblocks;
	uint32_t inodechecksum[W25FS_INODESECTORSCOUNT + 1];
} __attribute__((packed));

struct w25fs_inode {
	uint32_t nextfree;
	uint32_t blocks;
	uint32_t size;
	uint32_t type;
} __attribute__((packed));

struct w25fs_blockmeta {
	w25fs_checksum_t checksum;
	uint32_t next;
	uint32_t datasize;
} __attribute__((packed));

static int Delay[] = {0, 10, 100, 1000, 5000};

static uint8_t Sbuf[4];
static uint8_t Rbuf[4];

SPI_HandleTypeDef *Hspi;

static int w25_getid()
{
	Sbuf[0] = 0x9f;

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_SPI_Transmit(Hspi, Sbuf, 1, 5000);
	HAL_SPI_Receive(Hspi, Rbuf, 3, 5000);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

	return ((Rbuf[0] << 16) | (Rbuf[1] << 8) | Rbuf[2]);
}

int w25_init()
{
	HAL_Delay(100);

	Sbuf[0] = 0x66;
	Sbuf[1] = 0x99;

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_SPI_Transmit(Hspi, Sbuf, 2, 5000);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

	HAL_Delay(100);

	return w25_getid();
}

static int w25_writeenable()
{
	Sbuf[0] = 0x06;

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_SPI_Transmit(Hspi, Sbuf, 1, 5000);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

	return 0;
}

static int w25_writedisable()
{
	Sbuf[0] = 0x04;

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_SPI_Transmit(Hspi, Sbuf, 1, 5000);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

	return 0;
}

static int w25_waitwrite()
{
	Sbuf[0] = 0x05;

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);

	HAL_SPI_Transmit(Hspi, Sbuf, 1, 5000);

	do {
		HAL_SPI_Receive(Hspi, Rbuf, 1, 5000);
	} while ((Rbuf[0] & 0x01) == 0x01);

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

	return 0;
}

static int w25_blockprotect(uint8_t flags)
{
	Sbuf[0] = 0x50;

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_SPI_Transmit(Hspi, Sbuf, 1, 5000);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

	Sbuf[0] = 0x01;
	Sbuf[1] = (flags & 0x0f) << 2;

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_SPI_Transmit(Hspi, Sbuf, 2, 5000);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

	return 0;
}

int w25_read(uint32_t addr, uint8_t *data, uint32_t sz)
{
	Sbuf[0] = 0x03;
	Sbuf[1] = (addr >> 16) & 0xff;
	Sbuf[2] = (addr >> 8) & 0xff;
	Sbuf[3] = addr & 0xff;

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_SPI_Transmit(Hspi, Sbuf, 4, 5000);
	HAL_SPI_Receive(Hspi, data, sz, 5000);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

	return 0;
}

int w25_write(uint32_t addr, const uint8_t *data, uint32_t sz)
{
	w25_waitwrite();

	w25_blockprotect(0x00);
	w25_writeenable();

	Sbuf[0] = 0x02;
	Sbuf[1] = (addr >> 16) & 0xff;
	Sbuf[2] = (addr >> 8) & 0xff;
	Sbuf[3] = addr & 0xff;

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_SPI_Transmit(Hspi, Sbuf, 4, 5000);
	HAL_SPI_Transmit(Hspi, (uint8_t  *) data, sz, 5000);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

	w25_waitwrite();
	w25_writedisable();
	w25_blockprotect(0x0f);

	return 0;
}

int w25_eraseall()
{
	w25_waitwrite();
	w25_blockprotect(0x00);
	w25_writeenable();

	Sbuf[0] = 0xc7;

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_SPI_Transmit(Hspi, Sbuf, 1, 5000);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

	w25_waitwrite();
	w25_writedisable();
	w25_blockprotect(0x0f);

	return 0;
}

int w25_erasesector(uint32_t addr)
{
	w25_waitwrite();
	w25_blockprotect(0x00);
	w25_writeenable();

	Sbuf[0] = 0x20;
	Sbuf[1] = (addr >> 16) & 0xff;
	Sbuf[2] = (addr >> 8) & 0xff;
	Sbuf[3] = addr & 0xff;

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_SPI_Transmit(Hspi, Sbuf, 4, 5000);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

	w25_waitwrite();
	w25_writedisable();
	w25_blockprotect(0x0f);

	return 0;
}

int w25_eraseblock(uint32_t n)
{
	uint32_t addr;

	w25_waitwrite();
	w25_blockprotect(0x00);
	w25_writeenable();

	addr = n * W25_BLOCKSIZE;

	Sbuf[0] = 0xD8;
	Sbuf[1] = (addr >> 16) & 0xff;
	Sbuf[2] = (addr >> 8) & 0xff;
	Sbuf[3] = addr & 0xff;

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_SPI_Transmit(Hspi, Sbuf, 4, 5000);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

	w25_waitwrite();
	w25_writedisable();
	w25_blockprotect(0x0f);

	return 0;
}

static int w25_writesector(uint32_t addr, const uint8_t *data,
	uint32_t sz)
{
	int i;

	for (i = 0; i < sz; i += min(W25_PAGESIZE, sz - i))
		w25_write(addr + i, data + i, W25_PAGESIZE);

	return 0;
}

static int w25_rewritesector(uint32_t addr, const uint8_t *data,
	uint32_t sz)
{
	int i;

	w25_erasesector(addr);

	for (i = 0; i < sz; i += min(W25_PAGESIZE, sz - i))
		w25_write(addr + i, data + i, W25_PAGESIZE);

	return 0;
}

uint32_t w25fs_checksum(const uint8_t *buf, uint32_t size)
{
	uint32_t chk, i;

	chk = 0;
	for (i = 0; i < size / 4; ++i)
		chk ^= ((uint32_t *) buf)[i];

	return chk;
}

static int w25fs_checkdata(uint32_t addr, uint32_t size,
	w25fs_checksum_t cs)
{
	uint8_t buf[W25_PAGESIZE];
	uint32_t i, ccs;

	ccs = 0;
	for (i = 0; i < size; i += W25_PAGESIZE) {
		uint32_t cursz;

		cursz = min(size - i, W25_PAGESIZE);

		w25_read(addr + i, buf, cursz);

		ccs ^= w25fs_checksum(buf, cursz);
	}

	return (ccs == cs);
}

static int w25fs_readsuperblock(struct w25fs_superblock *sb)
{
	int i;

