PinkFluffyUnic0rn/stm32flash/w25.c
	r = w25fs_inodeget(parn, buf, W25FS_DIRSIZE);
	if (w25fs_iserror(r))
		return w25fs_uint2interr(r);	

	offset = w25fs_dirfindinode(buf, 0xffffffff);

	memmove(buf + offset, (uint8_t *) &n, sizeof(uint32_t));
	strcpy((char *) buf + offset + sizeof(uint32_t), name);

	b = 0xffffffff;
	memmove(buf + offset + W25FS_DIRRECORDSIZE,
		(uint8_t *) &b, sizeof(uint32_t));

	if ((w25fs_iserror(parn = w25fs_inodeset(parn, buf,
			W25FS_DIRSIZE)))) {
		return w25fs_uint2interr(r);
	}

	return 0;
}

static int w25fs_dirdeleteinode(uint32_t parn, uint32_t n)
{
	uint8_t buf[W25FS_DIRSIZE];
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	uint32_t offset, last, r, b;

	w25fs_readsuperblock(&sb);
	w25fs_readinode(&in, parn, &sb);

	if (in.type != W25FS_DIR)
		return W25FS_ENOTADIR;

	r = w25fs_inodeget(parn, buf, W25FS_DIRSIZE);
	if (w25fs_iserror(r))
		return w25fs_uint2interr(r);

	last = w25fs_dirfindinode(buf, 0xffffffff);
	if (last == 0)
		return (-1);

	if (last != W25FS_DIRRECORDSIZE)
		last -= W25FS_DIRRECORDSIZE;

	offset = w25fs_dirfindinode(buf, n);

	memmove(buf + offset, buf + last, W25FS_DIRRECORDSIZE);

	b = 0xffffffff;
	memmove(buf + last, (uint8_t *) &b, sizeof(uint32_t));

	w25fs_inodeset(parn, buf, W25FS_DIRSIZE);

	return 0;
}

static int w25fs_dirisempty(uint32_t n)
{
	uint8_t buf[W25FS_DIRSIZE];
	uint32_t r, nn;

	if (w25fs_iserror(r = w25fs_inodeget(n, buf, W25FS_DIRSIZE)))	
		return w25fs_uint2interr(r);

	memmove(&nn, buf, sizeof(uint32_t));

	return ((nn != 0xffffffff) ? W25FS_EDIRNOTEMPTY : 0);
}

static int _w25fs_dirlist(uint32_t n, char *lbuf, size_t sz)
{
	uint8_t buf[W25FS_DIRSIZE];
	uint32_t offset, r;

	if (w25fs_iserror(r = w25fs_inodeget(n, buf, W25FS_DIRSIZE)))	
		return w25fs_uint2interr(r);

	lbuf[0] = '\0';
	for (offset = 0; ; offset += W25FS_DIRRECORDSIZE) {
		uint32_t nn;

		nn = 0xffffffff;

		memmove(&nn, buf + offset, sizeof(uint32_t));

		if (nn == 0xffffffff)
			break;

		strcat(lbuf, (char *) buf + offset + sizeof(uint32_t));
		strcat(lbuf, "\n\r");
	}

	return 0;
}

int w25fs_init(SPI_HandleTypeDef *hs)
{
	Hspi = hs;

	w25_init();

	return 0;
}

int w25fs_dircreate(const char *path)
{
	char *toks[W25FS_PATHMAX];
	char *fname;
	uint32_t parn, n, b;
	int tokc;

	tokc = w25fs_splitpath(path, toks, W25FS_PATHMAX);

	if (tokc != 0 && w25fs_dirgetinode((const char **) toks)
			!= _W25FS_NAMENOTFOUND) {
		return W25FS_EALREADYEXISTS;
	}

	n = w25fs_inodecreate(W25FS_DIRSIZE, W25FS_DIR);
	if (w25fs_iserror(n))
		return w25fs_uint2interr(n);

	b = 0xffffffff;
	w25fs_inodeset(n, (uint8_t *) &b, sizeof(uint32_t));

	if (tokc == 0)
		return 0;

	fname = toks[tokc - 1];
	toks[tokc - 1] = NULL;

	if (w25fs_iserror(parn = w25fs_dirgetinode((const char **) toks)))
		return parn;

	return w25fs_diradd(parn, fname, n);
}

int w25fs_dirdelete(const char *path)
{
	char *toks[W25FS_PATHMAX];
	uint32_t parn, n;
	int tokc, r;

	tokc = w25fs_splitpath(path, toks, W25FS_PATHMAX);

	if (w25fs_iserror(n = w25fs_dirgetinode((const char **) toks)))
		return w25fs_uint2interr(n);

	if ((r = w25fs_dirisempty(n)) < 0)
		return r;

	toks[tokc - 1] = NULL;

	if (w25fs_iserror(parn = w25fs_dirgetinode((const char **) toks)))
		return w25fs_uint2interr(parn);

	if ((r = w25fs_dirdeleteinode(parn, n)) < 0)
		return r;

	if (w25fs_iserror(n = w25fs_inodedelete(n)))
		return w25fs_uint2interr(parn);

	return 0;
}

int w25fs_dirlist(const char *path, char *lbuf, size_t sz)
{
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	char *toks[W25FS_PATHMAX];
	uint32_t n;

	w25fs_splitpath(path, toks, W25FS_PATHMAX);

	if (w25fs_iserror(n = w25fs_dirgetinode((const char **) toks)))
		return w25fs_uint2interr(n);

	w25fs_readsuperblock(&sb);
	w25fs_readinode(&in, n, &sb);

	if (in.type != W25FS_DIR)
		return W25FS_ENOTADIR;

	return _w25fs_dirlist(n, lbuf, sz);
}

int w25fs_filewrite(const char *path, const char *buf, size_t sz)
{
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	char *toks[W25FS_PATHMAX];
	uint32_t n, r;

	w25fs_splitpath(path, toks, W25FS_PATHMAX);

	if (w25fs_iserror(n = w25fs_dirgetinode((const char **) toks)))
		return w25fs_uint2interr(n);

	w25fs_readsuperblock(&sb);
	w25fs_readinode(&in, n, &sb);

	in.type = W25FS_FILE;
	in.size = sz;

	if (w25fs_iserror(r = w25fs_deletedatablock(in.blocks, &sb)))
		return w25fs_uint2interr(r);

	in.blocks = w25fs_createdatablock(&sb, sz);
	if (w25fs_iserror(in.blocks))
		return w25fs_uint2interr(in.blocks);

	w25fs_writeinode(&in, n, &sb);
	w25fs_writesuperblock(&sb);

	if (w25fs_iserror(n = w25fs_inodeset(n, (uint8_t *) buf, sz)))
		return w25fs_uint2interr(n);

	return 0;
}

int w25fs_fileread(const char *path, char *buf, size_t sz)
{
	char *toks[W25FS_PATHMAX];
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	uint32_t n;

	w25fs_splitpath(path, toks, W25FS_PATHMAX);

	if (w25fs_iserror(n = w25fs_dirgetinode((const char **) toks)))
		return n;

	w25fs_readsuperblock(&sb);
	w25fs_readinode(&in, n, &sb);

	if (in.type != W25FS_FILE)
		return W25FS_ENOTAFILE;

	if (w25fs_iserror(n = w25fs_inodeget(n, (uint8_t *) buf, sz)))
		return w25fs_uint2interr(n);

	return 0;
}

int w25fs_dirstat(const char *path, struct w25fs_dirstat *st)
{
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	char *toks[W25FS_PATHMAX];
	uint32_t n;
	int r;

	if ((r = w25fs_splitpath(path, toks, W25FS_PATHMAX)) < 0)
		return r;

	if (w25fs_iserror(n = w25fs_dirgetinode((const char **) toks)))
		return w25fs_uint2interr(n);

	w25fs_readsuperblock(&sb);
	w25fs_readinode(&in, n, &sb);

	st->size = in.size;
	st->type = in.type;

	return 0;
}

const char *w25fs_strfiletype(enum W25FS_INODETYPE type)
{
	char *W25FS_FILETYPE[] = {
		"empty", "file", "device", "directory"
	};

	return W25FS_FILETYPE[type];
}

const char *w25fs_strerror(enum W25FS_ERROR e)
{
	char *strerror[] = {
		"success",
		"run out of data blocks",
		"wrong address",
		"bad data block",
		"wrong size",
		"path is too long",
		"inode not found",
		"path not found",
		"not a directory",
		"not a regular file",
		"directory is not empty",
		"directory already exists"
	};

	return strerror[-e];
}
